[
    {
        "rank": 1,
        "title": "UltraShape 1.0: High-Fidelity 3D Shape Generation via Scalable Geometric Refinement",
        "url": "https://huggingface.co/papers/2512.21185",
        "upvotes": 14,
        "abstract": "In this report, we introduce UltraShape 1.0, a scalable 3D diffusion framework for high-fidelity 3D geometry generation. The proposed approach adopts a two-stage generation pipeline: a coarse global structure is first synthesized and then refined to produce detailed, high-quality geometry. To support reliable 3D generation, we develop a comprehensive data processing pipeline that includes a novel watertight processing method and high-quality data filtering. This pipeline improves the geometric quality of publicly available 3D datasets by removing low-quality samples, filling holes, and thickening thin structures, while preserving fine-grained geometric details. To enable fine-grained geometry refinement, we decouple spatial localization from geometric detail synthesis in the diffusion process. We achieve this by performing voxel-based refinement at fixed spatial locations, where voxel queries derived from coarse geometry provide explicit positional anchors encoded via RoPE, allowing the diffusion model to focus on synthesizing local geometric details within a reduced, structured solution space. Our model is trained exclusively on publicly available 3D datasets, achieving strong geometric quality despite limited training resources. Extensive evaluations demonstrate that UltraShape 1.0 performs competitively with existing open-source methods in both data processing quality and geometry generation. All code and trained models will be released to support future research.",
        "korean_summary": "고품질 3D 형상 생성을 위한 확장 가능한 3D 확산 프레임워크인 UltraShape 1.0은, 조악한 전역 구조를 합성한 후 정교한 기하학적 디테일을 다듬는 2단계 파이프라인을 제안합니다.",
        "key_points": [
            "구멍 메우기, 얇은 구조물 두껍게 하기 등을 통해 기하학적 품질을 개선하는 독창적인 방수(watertight) 처리 방법을 포함한 포괄적인 데이터 처리 파이프라인을 구축했습니다.",
            "조악한 전역 구조를 먼저 합성한 후 세부 기하학적 디테일을 정교하게 다듬는 2단계 생성 파이프라인을 채택하여 고품질 결과를 얻습니다.",
            "확산 모델이 지역적 디테일 합성에 집중하도록, 조악한 형상에서 파생된 RoPE 인코딩 위치 앵커를 활용하여 공간 위치 지정과 디테일 합성을 분리하는 복셀 기반 정제 방식을 구현했습니다."
        ],
        "image_url": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.21185.png",
        "local_image_path": "images/UltraShape_1.0_High-Fidelity_3D_Shape_Generation_via_Scalable_Geometric_Refinement_img.jpg",
        "local_figures": []
    },
    {
        "rank": 2,
        "title": "DreamOmni3: Scribble-based Editing and Generation",
        "url": "https://huggingface.co/papers/2512.22525",
        "upvotes": 9,
        "abstract": "Recently unified generation and editing models have achieved remarkable success with their impressive performance. These models rely mainly on text prompts for instruction-based editing and generation, but language often fails to capture users intended edit locations and fine-grained visual details. To this end, we propose two tasks: scribble-based editing and generation, that enables more flexible creation on graphical user interface (GUI) combining user textual, images, and freehand sketches. We introduce DreamOmni3, tackling two challenges: data creation and framework design. Our data synthesis pipeline includes two parts: scribble-based editing and generation. For scribble-based editing, we define four tasks: scribble and instruction-based editing, scribble and multimodal instruction-based editing, image fusion, and doodle editing. Based on DreamOmni2 dataset, we extract editable regions and overlay hand-drawn boxes, circles, doodles or cropped image to construct training data. For scribble-based generation, we define three tasks: scribble and instruction-based generation, scribble and multimodal instruction-based generation, and doodle generation, following similar data creation pipelines. For the framework, instead of using binary masks, which struggle with complex edits involving multiple scribbles, images, and instructions, we propose a joint input scheme that feeds both the original and scribbled source images into the model, using different colors to distinguish regions and simplify processing. By applying the same index and position encodings to both images, the model can precisely localize scribbled regions while maintaining accurate editing. Finally, we establish comprehensive benchmarks for these tasks to promote further research. Experimental results demonstrate that DreamOmni3 achieves outstanding performance, and models and code will be publicly released.",
        "korean_summary": "DreamOmni3는 텍스트 프롬프트의 한계를 극복하기 위해 스크리블 기반 편집 및 생성 작업을 정의하고, 이를 처리하는 새로운 조인트 입력 프레임워크와 전용 학습 데이터셋을 구축하여 정밀한 시각적 제어를 가능하게 한다.",
        "key_points": [
            "텍스트 외에도 이미지 및 자유형 스케치(스크리블)를 활용하여 정밀한 위치 지정 및 세밀한 시각적 조작을 가능하게 하는 스크리블 기반 편집 및 생성이라는 새로운 작업을 제안한다.",
            "스크리블 기반 편집(4가지 하위 작업) 및 생성(3가지 하위 작업)을 포괄하는 새로운 데이터 합성 파이프라인을 구축하여 DreamOmni2 데이터셋을 확장하고 훈련 데이터를 구성한다.",
            "복잡한 바이너리 마스크 대신, 원본 이미지와 스크리블된 소스 이미지를 색상으로 구분하여 동시에 모델에 입력하는 '조인트 입력 체계(joint input scheme)'를 제안하여 정확한 지역화 및 편집을 수행한다."
        ],
        "image_url": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.22525.png",
        "local_image_path": "images/DreamOmni3_Scribble-based_Editing_and_Generation_img.jpg",
        "local_figures": []
    },
    {
        "rank": 3,
        "title": "End-to-End Test-Time Training for Long Context",
        "url": "https://huggingface.co/papers/2512.23675",
        "upvotes": 6,
        "abstract": "We formulate long-context language modeling as a problem in continual learning rather than architecture design. Under this formulation, we only use a standard architecture -- a Transformer with sliding-window attention. However, our model continues learning at test time via next-token prediction on the given context, compressing the context it reads into its weights. In addition, we improve the model's initialization for learning at test time via meta-learning at training time. Overall, our method, a form of Test-Time Training (TTT), is End-to-End (E2E) both at test time (via next-token prediction) and training time (via meta-learning), in contrast to previous forms. We conduct extensive experiments with a focus on scaling properties. In particular, for 3B models trained with 164B tokens, our method (TTT-E2E) scales with context length in the same way as Transformer with full attention, while others, such as Mamba 2 and Gated DeltaNet, do not. However, similar to RNNs, TTT-E2E has constant inference latency regardless of context length, making it 2.7 times faster than full attention for 128K context. Our code is publicly available.",
        "korean_summary": "긴 문맥 언어 모델링을 위한 TTT-E2E 방법론은 표준 트랜스포머 구조를 사용하여 테스트 시간에 연속적으로 학습하며, 완전한 주의 집중 모델과 동등한 확장성을 보이면서도 문맥 길이에 독립적인 일정한 추론 속도를 제공한다.",
        "key_points": [
            "긴 문맥 언어 모델링 문제를 구조 설계가 아닌 연속 학습(Continual Learning) 문제로 재정의하고, 슬라이딩 윈도우를 사용하는 표준 트랜스포머 구조를 기반으로 한다.",
            "기존 방식과 달리, 다음 토큰 예측을 통해 테스트 시간에 지속적으로 학습(Test-Time Training, TTT)하여 문맥 정보를 모델 가중치에 압축하며, 훈련 시간에 메타 학습을 적용하여 E2E(End-to-End) 학습을 완성한다.",
            "TTT-E2E는 Mamba 2나 Gated DeltaNet과 달리 완전한 주의 집중(full attention) 방식과 동일하게 문맥 길이에 비례하는 확장성을 보이며, 문맥 길이에 관계없이 일정한 추론 지연 시간(constant inference latency)을 유지하여 128K 문맥에서 2.7배 더 빠르다."
        ],
        "image_url": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.23675.png",
        "local_image_path": "images/End-to-End_Test-Time_Training_for_Long_Context_img.jpg",
        "local_figures": []
    },
    {
        "rank": 4,
        "title": "Evaluating Parameter Efficient Methods for RLVR",
        "url": "https://huggingface.co/papers/2512.23165",
        "upvotes": 5,
        "abstract": "We systematically evaluate Parameter-Efficient Fine-Tuning (PEFT) methods under the paradigm of Reinforcement Learning with Verifiable Rewards (RLVR). RLVR incentivizes language models to enhance their reasoning capabilities through verifiable feedback; however, while methods like LoRA are commonly used, the optimal PEFT architecture for RLVR remains unidentified. In this work, we conduct the first comprehensive evaluation of over 12 PEFT methodologies across the DeepSeek-R1-Distill families on mathematical reasoning benchmarks. Our empirical results challenge the default adoption of standard LoRA with three main findings. First, we demonstrate that structural variants, such as DoRA, AdaLoRA, and MiSS, consistently outperform LoRA. Second, we uncover a spectral collapse phenomenon in SVD-informed initialization strategies (e.g., PiSSA, MiLoRA), attributing their failure to a fundamental misalignment between principal-component updates and RL optimization. Furthermore, our ablations reveal that extreme parameter reduction (e.g., VeRA, Rank-1) severely bottlenecks reasoning capacity. We further conduct ablation studies and scaling experiments to validate our findings. This work provides a definitive guide for advocating for more exploration for parameter-efficient RL methods.",
        "korean_summary": "검증 가능한 보상 기반 강화 학습(RLVR) 환경에서 12가지 이상의 PEFT 방법론을 체계적으로 평가한 결과, 구조적 변형들이 표준 LoRA보다 우수하며, SVD 기반 초기화 전략은 최적화 과정의 불일치로 인해 실패하고 극단적인 매개변수 축소는 추론 능력을 저해함을 입증했다.",
        "key_points": [
            "DoRA, AdaLoRA, MiSS와 같은 구조적 변형 PEFT 방법론들은 표준 LoRA를 능가하며 일관되게 우수한 성능을 보였다.",
            "PiSSA, MiLoRA 등 SVD 정보를 활용하는 초기화 전략들은 주성분 업데이트와 RL 최적화 간의 근본적인 불일치로 인해 스펙트럼 붕괴(Spectral Collapse) 현상을 보이며 성능이 저조했다.",
            "VeRA 및 Rank-1과 같은 극단적인 수준의 매개변수 축소는 언어 모델의 추론 능력을 심각하게 제한하는 병목 현상을 야기한다."
        ],
        "image_url": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.23165.png",
        "local_image_path": "images/Evaluating_Parameter_Efficient_Methods_for_RLVR_img.jpg",
        "local_figures": []
    },
    {
        "rank": 5,
        "title": "GraphLocator: Graph-guided Causal Reasoning for Issue Localization",
        "url": "https://huggingface.co/papers/2512.22469",
        "upvotes": 1,
        "abstract": "The issue localization task aims to identify the locations in a software repository that requires modification given a natural language issue description. This task is fundamental yet challenging in automated software engineering due to the semantic gap between issue description and source code implementation. This gap manifests as two mismatches:(1) symptom-to-cause mismatches, where descriptions do not explicitly reveal underlying root causes; (2) one-to-many mismatches, where a single issue corresponds to multiple interdependent code entities. To address these two mismatches, we propose GraphLocator, an approach that mitigates symptom-to-cause mismatches through causal structure discovering and resolves one-to-many mismatches via dynamic issue disentangling. The key artifact is the causal issue graph (CIG), in which vertices represent discovered sub-issues along with their associated code entities, and edges encode the causal dependencies between them. The workflow of GraphLocator consists of two phases: symptom vertices locating and dynamic CIG discovering; it first identifies symptom locations on the repository graph, then dynamically expands the CIG by iteratively reasoning over neighboring vertices. Experiments on three real-world datasets demonstrates the effectiveness of GraphLocator: (1) Compared with baselines, GraphLocator achieves more accurate localization with average improvements of +19.49% in function-level recall and +11.89% in precision. (2) GraphLocator outperforms baselines on both symptom-to-cause and one-to-many mismatch scenarios, achieving recall improvement of +16.44% and +19.18%, precision improvement of +7.78% and +13.23%, respectively. (3) The CIG generated by GraphLocator yields the highest relative improvement, resulting in a 28.74% increase in performance on downstream resolving task.",
        "korean_summary": "GraphLocator는 인과 구조 발견과 동적 이슈 분리 기법을 사용하여 소프트웨어 이슈 설명과 소스 코드 간의 의미론적 불일치 문제를 해결하고, 인과 이슈 그래프(CIG)를 통해 정확한 이슈 위치를 식별하는 새로운 접근법이다.",
        "key_points": [
            "이슈 설명이 원인을 명시하지 않는 ‘증상-원인 불일치’와 하나의 이슈가 다수의 상호 의존적인 코드로 이어지는 ‘일대다 불일치’ 문제를 해결하는 것을 목표로 한다.",
            "핵심 아티팩트는 인과 이슈 그래프(CIG)로, 발견된 하위 이슈와 관련 코드 엔티티를 정점으로, 그 사이의 인과적 의존성을 엣지로 표현하여 인과적 추론을 가능하게 한다.",
            "기존 기준선 대비 평균적으로 함수 수준 재현율(Recall)에서 19.49%, 정확도(Precision)에서 11.89% 향상된 이슈 위치 식별 정확도를 달성했으며, 특히 복잡한 불일치 시나리오에서 우수한 성능을 입증했다."
        ],
        "image_url": "https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.22469.png",
        "local_image_path": "images/GraphLocator_Graph-guided_Causal_Reasoning_for_Issue_Localization_img.jpg",
        "local_figures": []
    }
]